/***********************************************************************************/
/* author: 林清将
/* update logs:
/* 2019/6/10 林清将 创建
/***********************************************************************************/
import { Component, OnInit, OnDestroy } from '@angular/core';
import { ContainerComponent, ContainerService } from '@qiuer/core';

export interface BlankMetadata {
  id: string;
  label?: string;
  type: string;
}
/***********************************************************************************/
/*                                     组件                                        */
/* 方法:
/***********************************************************************************/
@Component({
  selector: 'blank-ctrl',
  templateUrl: './blank.component.html',
  styleUrls: ['./blank.component.scss']
})
export class BlankControllerComponent extends ContainerComponent implements OnInit, OnDestroy {

  constructor(public _service: ContainerService) {
    super(_service);
  }

  /***********************************************************************************/
  /*                            生命周期 life cycle                                  */
  /***********************************************************************************/
  ngOnInit(): void {
    super.ngOnInit();
  }
  ngOnDestroy(): void {
    super.ngOnInit();
  }

  /***********************************************************************************/
  /*                           存取器get/set 用户使用                                */
  /***********************************************************************************/

  /***********************************************************************************/
  /*                              互相调用  for call                                 */
  /***********************************************************************************/

  /***********************************************************************************/
  /*                    私有或继承  for private or inherit                           */
  /***********************************************************************************/
}
